<template>
  <a-modal
      title="유일 이용약관"
      v-model:open="store.state.isModalOpen"
      @ok="handleOk"
      @cancel="handleModalClose"
      okText="동의"
      cancelText="닫기"
      class="policyModal"
  >
    <div class="modal-content">
      <p class="sectionTitle">제1조 목적 및 용어의정의</p>
      <p>이 약관은 개발 및 운영하는 반자동프로그램 유일(이하 “유일”이라합니다.)</p>
      <p>"유일” 제공하는 구매대행 솔루션 (이하 “솔루션”이라 합니다.)</p>
      <p>“솔루션” 접속하여 약관에 동의하고 회원가입후 승인받은 자 이하“회원”이라 합니다.</p>
      <p>“솔루션”을 이용함에 있어 사용자의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.</p>

      <p class="sectionTitle">제2조 약관의 효력 및 개정</p>
      <p>이 약관의 사용하는 용어의 정의는 다음과 같습니다.</p>
      <div class="paragraph">
        <p>1.“유일” 필요시 약관의 내용을 변경 및 수정할 수 있으며 변경된 약관은 “솔루션”프로그램 공지사항에 “회원”이 확인할 수 있도록 공지합니다.</p>
        <p>2.변경되어질 약관은 10일 이전에 공지합니다.</p>
        <p>3.“회원”은 변경된 약관에 동의하지 않을 경우 “유일”은 서비스 이용을 제한하거나 중단할 수 있으며 사용자의 “회원”등록을 취소할 수 있습니다.</p>
        <p>4.“회원”은 변경된 약관에 10일동안 동의하지 않고 계속해서 사용하는 경우 변경된 약관에 동의한 걸로 간주하고 변경된 약관에 같은 방법으로 효력이 계속해서 발생합니다.</p>
        <p>5.효력 “회원”이 약관에 동의한 경우 약관이 우선적으로 적용됩니다.</p>
        <p>6.이 약관에서 정하지 아니한 사항과 명시되지 않은 사항에 대해서는 이 약관의 해석에 관하여는 약관의 규제 등에 관한 법률, 정보통신윤리위원회, 전기통신사업법,
        정보통신 윤리강령, 심의규정및 관계법령 또는 상관례에 따릅니다.</p>
      </div>

      <p class="sectionTitle">제3조 “솔루션" 서비스의 제공 및 이용계약</p>
      <div class="paragraph">
        <p>1.회원가입 “솔루션”에서 정한 가입 양식에 따라 회원정보를 입력 후 약관에 동의 후 회원가입 신청을 할 수 있습니다.</p>
        <p>2.“솔루션”은 각호에 해당하는 사유에 적합하지 않은 회원가입 신청자는 반려 및 보류 회원자격 제한시킬 수 있습니다.</p>
        <p>(1)개인신상정보 내용의 허위기재</p>
        <p>(2)개인신상정보 기재 누락</p>
        <p>(3)“솔루션”에 정책 및 기술 유출이 의심되는 자</p>
        <p>(4)타인의 명의를 도용하여 사용한 자</p>
        <p>(5)의도적으로 “솔루션”을 비방 및 저해할 목적으로 가입이 의심되는 자</p>
        <p>(6)타 프로그램에서 부정한 방법 (매크로사용)의심되는 자</p>
      </div>

      <p class="sectionTitle">제4조 결제 및 서비스 이용</p>
      <div class="paragraph">
        <p>1.”유일”은 “솔루션”회원가입 자에 한하여 현금 및 카드 결제를 이용하여 결제대금을 지급한 “회원”에 한하여 “솔루션”에서 정한 방법으로
        결제 대금만큼 기간을 구매한 회원에 한하여 기간 승인을 진행 후 서비스를 개시합니다.</p>
        <p>2.서비스의 이용 “솔루션”의 승인이 이루어진 직후 즉시 사용가능 하며서비스이용 시간은 1일24시간 365일을 원칙으로 합니다.</p>
        <p>3.“솔루션”이용은 유료서비스입니다. (요금표 참고)</p>
      </div>

      <p class="sectionTitle">제5조 서비스의 중단 및 변경 중지</p>
      <div class="paragraph">
        <p>1.”솔루션”은 국가의 비상사태, 천재지변, 정보통신설비의 보수 및 점검 등의 사유로 인해 서비스를 일시중단 할 수 있으며 이로 인해 발생된 피해는“솔루션”에서 책임지지 않습니다.</p>
        <p>2.”솔루션”은 제5조 1항에 사유로 서비스 제공이 중단 및 중지된 경우 신의와 성실의 의무를 다하여 지체없이 복구할 것입니다.</p>
        <p>3.”솔루션”은 5조1항에 사유가 발생될 시 “회원” 회원가입할 당시 등록된 정보로 즉시 개별 및 전체공지를 통해 위 사실을 통지할 것입니다.</p>
        <p>4.”솔루션”의 사정으로 인해 “유일” 서비스를 영구적으로 중단할 경우 1개월전에 사전 고지할 것입니다.</p>
        <p>5.유지보수 및 업데이트 “솔루션” 불가피한 중요 업데이트 있을 시 사전 1주일전에 고지하고 서비스를 중지시킬 수 있습니다. 5조5항에
          “회원”이 사용하지 못한 기간만큼 “솔루션”은 “회원”요구에 맞게 기간 연장을 연장해줄 것입니다.</p>
      </div>

      <p class="sectionTitle">제6조 정보제공 의무</p>
      <p>“솔루션”은 “회원”이 서비스를 이용하는데 있어 필요하다고 인정되는 정보에 한하여 전자메일 우편 문자 카톡 등 다양한방법으로 회원에게
        제공 할 수 있으며 “회원”은원치 않는 경우 이를 수신거부 할 수 있습니다.</p>
     <p>단 5조1항에 의거하는 중대한 사한에 대해서는 “회원”의 수신거부 의사와 상관없이 해당내용을 고시할 수 있습니다.</p>

      <p class="sectionTitle">제7조 "회원" 자격상실 및 탈퇴 자격박탈 계약해지</p>
      <div class="paragraph">
        <p>1.”회원”은 언제든 탈퇴요청을 할 수 있으며 “솔루션”은 약관의 의거 합당한 요청이라면 즉시 탈퇴처리를 할 수 있습니다. (고객센터를 통해 해당 탈퇴요청을 해야 합니다.)</p>
        <p>2.”솔루션”은 각항에 해당하는 경우 “회원”의 동의없이 회원자격을 제한하거나 정지 및 탈퇴시킬 수 있습니다.</p>
        <p>(1)회원가입시 허위 내용 기재</p>
        <p>(2)매크로프로그램사용으로 “솔루션” 서버의 과부하 및 부적절한 방법을 사용 또는 의심되는 자</p>
        <p>(3)“솔루션”의 욕설 및 비방 또는 다른 회원의 “솔루션”이용을 방해하거나 서비스 이용질서를 위협 및 어지럽힌 자</p>
        <p>(4)제3조2항에 위반되는 자</p>
        <p>(5)범죄행위 및 도용이 확인 및 의심되는 자</p>
        <p>(6)타인의 명예를 손상시키거나 불이익을 준 경우</p>
        <p>(7)불법적인 방법으로 “솔루션”에 피해를 입한 자</p>
        <p>(8)“솔루션”이 정한 약관 및 법령에 위배되는 자</p>
        <p>(9)타인의 아이디 해킹 및 도용한자</p>
        <p>(10)반사회적인 방법으로 제3자 또는 “솔루션회원”등을 선동한자</p>
        <p>(11)“회원”본인의 관리소홀로 인해 아이디 도용 및 해킹 이용자의 정보가 제 3자에게 유출 된 경우 이에 관한 책임은 “회원”에게 있습니다. (제7조1항
          타 의거 “회원”아이디 변경 및 삭제 등을 “솔루션”에 요청할 수 있습니다.)</p>
        <p>(12)“솔루션”제7조1,2 각조항에 의거 사유가 발생되면 자격 제한 및 정지시킨 후 일정기간을 시정요청 할 수 있으며 시정요청을 받았음에도
          시정되지 않을 경우 “솔루션”은 “회원”통지 없이 “회원” 자격 제한 및 상실시킬 수 있습니다.</p>
      </div>

      <p class="sectionTitle">제8조 개인정보 보호</p>
      <div class="paragraph">
        <p>1.”솔루션”은 “회원”의 제공하는 정보를 개인정보취급 방침에 따릅니다.</p>
        <p>2.”솔루션”은 개인정보 수집 시 최소한의 정보를 수집하며 개인정보를 수집할 때에는 반드시 “회원”의 동의를 받습니다.</p>
        <p>3.제공된 정보는 제3자에게 제공 및 배포할 수 없으며 상업적으로 사용할 수 없습니다.</p>
        <p>4.”회원”은 “솔루션”에 개인정보 정정요구를 할 수 있으며 “솔루션은” 필요한 조치를 취해야 합니다.</p>
        <p>5.”솔루션”은 각호에 해당하는 경우 예외로 합니다.</p>
        <p>(1)법령에 의거 수사상 목적이 있어 관계기관으로부터 요구가 있는 경우</p>
        <p>(2)대금 정산을 위하여 필요한 경우</p>
        <p>(3)도용방지를 위해 본인확인이 필요한 경우</p>
        <p>(4)제3자에 대한 정보 제공 관련사항 (제공 받는 자, 제공 목적 및 제공할 정보의 내용) 등 정보통신망 이용촉진 및 정보보호 등에 관한 법률
          제 22조 제 2항이 규정한 사항을 미리 명시하거나 고지해야 하며 회원은 언제든지 이 동의를 철회할 수 있습니다.</p>
      </div>

      <p class="sectionTitle">제9조 양도 양수 금지조항</p>
      <p>“회원”은 이용기간, 권한 아이디 등 “솔루션”에 관련된 일체 정보 및 권한을 타인에게 양도 양수 할 수 없습니다.</p>

      <p class="sectionTitle">제10조 "회원의 의무"</p>
      <div class="paragraph">
        <p>1.”회원”은 “솔루션”이 제공하는 서비스를 약관 및 관련법률에 준수하여야 하며 “솔루션”에 피해가 되거나 업무에 방해가 되는 행위 일체를 해서는 안됩니다.</p>
        <p>2.”회원”은 “솔루션”이 제공하는 서비스 일체만 사용하여야 하며 “솔루션”서버의 접근 및 해킹을 시도해서는 안됩니다.</p>
        <p>3.”솔루션”프로그램의 복사 출판 대여 임대 매매 전매 질권설정 담보설정 이전 변경 수정 또는 재배포 할 수 없습니다.</p>
        <p>4.”회원”일체 누구라도 “솔루션”의 승인없이 영리목적 영업 및 판매를 할 수 없다 이로 인해 발생되는 “솔루션”손해에 대해서는 “회원”은
          관할법률에 의거 손해 배상 청구될 수 있습니다.</p>
        <p>5.”회원”은 ID 및 비밀번호 등 제3자에게 해킹 및 도용 당한 경우 “솔루션”측에 즉각 이사실을 알려야 하며 이로 인해 발생된 피해는 “솔루션”책임지지 않습니다.</p>
        <p>6.”회원”은 “솔루션”프로그램으로 각 오픈마켓에 업로드시 제3자의 지적재산권을 침해해서는 안 되고 이로 인해 발생되는 민. 형사 상 문제는 “회원”이 책임집니다.</p>
        <p>7.”회원”은 주민등록상 1인 1사업자를 원칙으로 합니다.</p>
        <p>8.주말/공휴일 환불요청 시 법정공휴일을 제외한 월요일로 계산됩니다.</p>
      </div>

      <p class="sectionTitle">제11조 계약의 해지 및 손해배상 환불규정</p>
      <div class="paragraph">
        <p>1.”회원”은 유료서비스 (결제일)기준으로 합니다.</p>
        <p>2.”회원”은 결제 시 제공되는 추천인할인 “솔루션”이 제공하는 특별할인 등을 이용한 경우 중도해지시 계산되는 요금은 결제당시 할인되지
          않은 정가 1개월요금으로 환불금액을 산정합니다.</p>
        <p>3."회원"은 결제기준 7일이내 환불을 요청할 경우 사용금액은 1개월 정가금액 20만원/30일*이용일수 만큼 차감 후 환불된다. (할인금액으로
          결제를 하였어도 환불 시, 정가금액 기준으로 계산)</p>
        <p>3-2 승인일 기준 7일 이후 환불 요청할 경우, 취소 수수료(결제금액의 10%)가 부과되며, 사용금액은 1개월 정가금액 20만원/30일*이용일수
          만큼 차감 후 환불된다. (할인금액으로 결제를 하였어도 환불 시, 정가금액 기준으로 계산)</p>
        <p>4.”회원”은 “솔루션”이 제공한 유로 서비스 이용기간을 1/3이상 지난 경우 계약의 취소 또는 환불이 불가능하며 “솔루션”은 취소또는 환불을 거부할 수 있는 권리를 가집니다.</p>
        <p>5.특별 환불규정 제11조 4항에 해당하는 경우 “회원”과 “솔루션”은 원만한합의를 통해 제11조 3항에 의거하여 추가로 10프로를 제외한 금액을 환불할 수 있습니다.</p>
        <p>6.”솔루션”은 “회원” 제7조 제10조에 의거하여 계약을 해지할 수 있으며 남은 일수와 상관없이 교환 반품, 환불 등을 거부할 수 있는 권리를 가집니다.</p>
      </div>

      <p class="sectionTitle">제12조 관할법원</p>
      <p>“솔루션” “회원” 관련하여 발생된 분쟁은 “솔루션”소재지 관할지방법원으로 합니다.</p>
      <p>“솔루션”과 ”회원”은 발생한 분쟁을 원만히 해결하기 위해 필요한 모든 노력 및 방법을 사용합니다.</p>
      <p>특약사항</p>
      <p>“회원”은 지식재산권 (저작권 상표권 특허권)등을 위반한 경우 “솔루션”은 아무 책임이 없음을 알려드립니다.</p>
      <p>프로그램 사용동의 시 이 내용을 동의함으로 간주</p>
      <p>“솔루션”은 민, 형사상 법적 책임이 없음을 고지합니다.</p>

      <p class="sectionTitle">제13조 제휴 강사 및 제휴 업체 추천인</p>
      <p>”솔루션”이 지정한 강사 및 제휴업체만 추천인을 등록할 수 있으며 “회원” 및 “솔루션”은 회원가입시 등록한 추천인을 임의로 변경할 수 없습니다.</p>

      <p class="sectionTitle">제14조 면책사항</p>
      <p>각항에 해당하는 경우 “솔루션”과 “회원” 상호협의 하에 환불 및 철회 연장을 할 수 있습니다.</p>
      <div class="paragraph">
        <p>1.”솔루션”은 국가재난 사항 및 그에 준하는 사태에 해당할 경우</p>
        <p>2.천재지변 또는 이에 준하는 불가항력적인 요소로 서비스를 이행할 수 없을 경우</p>
        <p>3.”솔루션”은 아무 이유 없이 서비스를 중단한 경우</p>
      </div>

      <p class="sectionTitle">제15조 서브사업자</p>
      <div class="paragraph">
        <p>1.서브 사업자는 최초 가입한 본 사업에 이용요금이 남아있을 경우에만 사용가능하며 본 사업자에 남은 이용기간만큼 서브사업자의 할인 된 금액을 이용할 수 있습니다.
          (서브사업자 이용 요금표 참조)</p>
        <p>2.제11조 각항에 의거 환불규정을 다르게 실시합니다.</p>
        <p>3.승인일 기준 할인되지 않은 결제 금액/30일 이용일수적용 후 환불 취소 수수료 20%</p>
        <p>4.서브 사업자는 본계정과 명의가 동일해야 합니다.</p>
        <p>5.서브사업자는 기간별 할인 없이 동일요금표에 나와있는 요금으로 적용됩니다.</p>
        <p>6.본 계정 만료 시 서브사업자 자동 소멸됩니다.</p>
        <p>7.본계정을 삭제하고 서브사업자 계정만 사용하고 싶을 경우 본 계정 비용을 추가결제후 진행합니다.</p>
      </div>

      <p class="sectionTitle">제16조 개인정보 수집동의</p>
      <p>‘반자동프로그램 유일’ (이하 “솔루션”로 표기)은 고객님의 개인정보를 중요시하며, "정보통신망 이용촉진 및 정보보호"에 관한 법률을 준수하고 있습니다.</p>
      <div class="paragraph">
        <p>1. 개인정보의 수집 및 이용목적</p>
        <p>2. 수집하는 개인정보의 항목 및 수집방법</p>
        <p>3. 개인정보의 보유기간</p>
        <p>1. 개인정보의 수집 및 이용목적<br />“솔루션”은 수집한 개인정보를 다음의 목적을 위해 활용합니다.</p>
        <p>(1) 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금 정산 콘텐츠 제공, 청구서 등 발송, 구매 및 요금 결제, 금융서비스 및 본인 인증</p>
        <p>(2) 회원관리 회원제 서비스 이용 및 개인 식별, 불량회원의 부정 이용 방지와 비인가 사용방지, 가입의사 확인, 연령 확인, 민원 처리, 고지사항 전달</p>
        <p>(3) 마케팅 및 광고, 통계 활용 새 서비스 개발 및 서비스 제공, 광고 게재, 이벤트, 광고 제공, 정보 제공, 회원의 서비스 이용 통계 작성</p>
        <p>2. 수집하는 개인정보의 항목 및 수집방법<br />“솔루션"은 회원가입, 상담, 서비스 제공 등을 위해 다음과 같은 개인정보를 수집하고 있습니다.</p>
        <p>(1) 수집항목 </p>
        <ul>
          <li>필수 입력 항목 : 아이디, 이름, 비밀번호, 이메일 주소, 핸드폰번호, 사업자 정보 </li>
          <li>선택 입력 항목 : 추천인 아이디</li>
          <li>비 입력 항목 : 브라우저 종류, 운영체제, 검색어, 서비스 이용 및 방문 기록, IP주소, 쿠키</li>
        </ul>
        <p>(2) 수집방법<br/>홈페이지, 고객센터 문의, 이벤트 응모, 생성 정보 수집 도구를 통한 방법</p>
        <p>(3) 개인정보의 보유기간<br/>개인정보는 서비스를 이용하는 동안 원활한 서비스 이용을 위해 계속 보유하나 회원 탈퇴 신청이나 서비스
          중단 등의 상황이 발생할 경우 해당 정보를 바로 파기하거나 외부 공개를 막습니다. 단 다음의 경우에는 명시한 기간 동안 보존합니다.</p>
        <ul>
          <li>보존 항목: ID,생년월일,이메일 주소</li>
          <li>보존 이유: 서비스 이용의 혼선 방지, 불법적 사용자에 대한 관련 기관 수사협조</li>
          <li>보존기간: 1년</li>
        </ul>
        <p>또한 관계법령에 정한 기간 동안 회원정보를 보관할 수 있습니다.</p>
        <ul>
          <li> 보존 항목: 서비스 이용 기록,방문 기록, IP 정보</li>
          <li> 보존 이유: 통신비밀보호법</li>
          <li> 보존기간: 3개월</li>
        </ul>
      </div>

      <p class="sectionTitle">제17조 "솔루션"의무</p>
      <div class="paragraph">
        <p>1. ”솔루션”은 “회원”의 안정적인 사용을 위해 장애가 생기거나 오류 발생시 즉각적으로 이를 수리 또는 복구합니다.</p>
        <p>2. 2.”솔루션”은”회원”으로부터 의견이나 불만사항을 즉각 수렴하고 “회원”의 타당한 요구사항이라고 판단 시 적절한 절차를 거쳐 즉시
          처리하여야 하며 “솔루션”은 처리일정 및 내용을 “회원” 에게 공유 및 통보합니다.</p>
        <p>3. "회원"의 민원제기시"솔루션"은 이에 상응하는 조치를 즉각 이행하여야 합니다.</p>
        <p>4. "솔루션"은 반자동프로그램 유일의 제작 및 경영에 있어 제반 및 개발에 최선을 다하여야 합니다.</p>
      </div>

      <p class="sectionTitle">제18조 배송대행지</p>
      <p class="sectionTitle">제1장 총칙</p>
      <p class="sectionTitle">제1조 (목 적)</p>
      <p>이 약관은 ‘반자동프로그램 유일’(이하 “회사”라 합니다.)이 제공하는 서비스의 이용조건 및 절차, 기타 필요한 사항을 규정함을 목적으로 합니다.</p>
      <p class="sectionTitle">제2조 (약관의 효력 및 변경)</p>
      <div class="paragraph">
        <p>1.이 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로 회원에게 공지함으로써 효력이 발생합니다.</p>
        <p>2.회사는 합리적인 사유가 발생될 경우에는 이 약관을 변경할 수 있으며, 약관이 변경되는 경우에는 최소한 7일전에 1항과 같은 방법으로 공시합니다.</p>
        <p>3.본 사이트 안에 새로운 서비스가 개설될 경우 별도의 명시된 설명이 없는 한 이 약관에 따라 제공됩니다.</p>
      </div>
      <p class="sectionTitle">제3조 (약관 외 준칙)</p>
      <p>이 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법 및 기타 관련법령의 규정에 따릅니다.</p>
      <p class="sectionTitle">제4조 (정의)</p>
      <div class="paragraph">
        <p>1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
        <p>(1) 회 원 : 회사와 서비스 이용계약을 체결한 개인이나 법인 또는 법인에 준하는 단체</p>
        <p>(2) 운영자: 서비스의 전반적인 관리와 원활한 운영을 위하여 회사가 선정한 사람</p>
        <p>(3) 아이디(ID): 회원식별과 회원의 서비스 이용을 위하여 회원이 선정하고 회사가 승인하는 문자와 숫자의 조합</p>
        <p>(4) 비밀번호 : 회원의 정보 보호를 위해 회원 자신이 설정한 문자와 숫자의 조합</p>
        <p>(5) (5)서비스 중지:정상 이용 중 회사가 정한 일정한 요건에 따라 일정 기간 동안 서비스의 제공을 중지하는 것</p>
        <p>(6) 해지 : 회사 또는 회원이 서비스 개통 후 이용계약을 해약하는 것</p>
        <p>2. 본 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스 별 안내에서 정하는 바에 의합니다.</p>
      </div>
      <p class="sectionTitle">제2장 이용계약 체결</p>
      <p class="sectionTitle">제5조 (서비스의 구분)</p>
      <div class="paragraph">
        <p>3. 회사가 회원에게 제공하는 서비스는 기본서비스와 부가서비스 등으로 구분합니다.</p>
        <p>4. 서비스의 종류와 내용 등은 회사가 공지나 서비스 이용안내에서 별도로 정하는 바에 의합니다.</p>
      </div>
      <p class="sectionTitle">제6조 (이용계약의 성립)</p>
      <p>이용 약관에 회원이 "동의함" 버튼을 누르면 이 약관에 동의하는 것으로 간주됩니다. 약관 변경 시에도 이와 동일하며, 변경된 약관에
        동의하지 않을 경우 회원 등록 취소가 가능합니다.</p>
      <p class="sectionTitle">제7조 (서비스 이용신청)</p>
      <div class="paragraph">
        <p>5. 이용신청은 이용 신청자가 회사가 지정한 회원가입 신청서를 온라인으로 작성하여 제출함으로써 신청할 수 있습니다.</p>
        <p>6. 이용계약은 회원의 회원가입에 대하여 회사의 이용승낙으로 성립합니다.</p>
        <p>7. 다음과 같은 경우 회사는 이용 신청자의 이용 신청 승낙을 제한할 수 있고, 이 사유가 해소될 때까지 승낙을 유보할 수 있습니다.</p>
        <p>(1) 서비스 관련 설비 용량이 부족한 경우</p>
        <p>(2) 기술상 문제가 있는 경우</p>
        <p>(3) 기타 부득이한 사정이 있는 경우</p>
        <p>(4) 이용신청자는 다음 사항을 준수하여야 합니다.</p>
        <p>(5) 가입신청 양식에는 실명을 사용해야 합니다. 다른 사람의 명의를 사용하여 기재하지 않아야 합니다.</p>
        <p>(6) 회원가입 양식의 내용은 현재의 사실과 일치해야 합니다.사회의 안녕, 질서 또는 미풍양속을 저해할 목적으로 신청해서는 아니 됩니다.</p>
        <p>(7) 등록 양식 또는 그 내용에 변경이 생긴 경우 현재의 사실과 일치하는 완전한 정보로 갱신해야 합니다.</p>
        <p>(8) 이용신청자가 제공한 정보가 부정확하거나 현재의 사실과 일치하지 않는 경우,또는 그러하다고 의심할 수 있는 합리적인 이유가 있는
          경우 서비스 이용을 제한할 수 있습니다.</p>
        <p>(9) 만 14세 미만의 어린이는 부모 등 법정 대리인의 동의를 얻은 후에 서비스 이용을 신청하여야 합니다. 또한 만 20세 미만의 이용자가
          유료 서비스를 이용하고자 하는 경우에도 이와 같습니다.</p>
      </div>
      <p class="sectionTitle">제8조 (회원 아이디의 변경)</p>
      <div class="paragraph">
        <p>1. 다음의 경우 회사는 직권으로 회원 아이디를 변경하도록 요구하거나, 회원의 신청에 의해 회원 아이디를 변경할 수 있습니다.</p>
        <p>(1) 회원 아이디가 회원의 전화번호, 주민등록번호 등으로 등록되어 회원 사생활 침해의 우려가 있는 경우</p>
        <p>(2) 타인에게 혐오감을 주거나 미풍양속에 저해되는 경우</p>
        <p>(3) 기타 회사 소정의 합리적인 이유가 있는 경우</p>
      </div>
      <p class="sectionTitle">제9조 (회원 정보 사용에 대한 동의)</p>
      <div class="paragraph">
        <p>1. 회사가 이용 신청서에 기재를 요구하는 회원 정보는 본 이용계약을 이행하고 이용계약상 서비스 제공을 위한 목적으로 이용합니다.</p>
        <p>2. 회원들이 회사 및 제휴 업체의 서비스를 편리하게 사용할 수 있도록 하기 위해 회원 정보는 회사 및 제휴 업체에 제공될 수 있습니다.
          이 경우 회사는 사전에 공지하며 이에 동의하지 않는 회원은 등록을 취소할 수 있습니다. 다만 계속 이용하는 경우 동의하는 것으로 간주합니다.</p>
        <p>3. 전기통신사업법 등 법률 규정에 의해 국가 기관의 요구가 있는 경우, 수사상 목적이 있거나 정보 통신 윤리 위원회의 요청이 있는 경우
          또는 기타 관계법령 절차에 따른 정보제공 요청이 있는 경우 회원 정보가 제공될 수 있습니다.</p>
        <p>4. 회사는 업무와 관련하여 회원 전체 또는 일부의 개인정보에 관한 통계자료를 작성하여 사용하거나 이를 다른 기관에 제공할 수 있습니다.</p>
        <p>5. 회원은 언제든지 본인의 개인정보를 열람하고 변경사항을 정정할 수 있습니다.</p>
        <p>6. 회원이 약관의 내용에 동의하지 않고 등록을 취소하는 경우 회사는 회원의 정보를 삭제합니다.</p>
        <p>7. 회사는 서비스를 통해 회원의 컴퓨터에 쿠키를 전송할 수 있습니다. 회원은 쿠키 수신을 거부하거나 쿠키 수신에 대해 경고하도록 브라우저 설정을 변경할 수 있습니다.</p>
      </div>
      <p class="sectionTitle">제10조 (개인정보 수집 및 이용목적)</p>
      <div class="paragraph">
        <p>1. 회원의 서비스 질 향상과 사이트 이벤트 시 이용합니다.</p>
        <p>2. 회원 정보를 이용한 비용 청구</p>
        <p>3. 회원 정보를 이용한 마케팅</p>
      </div>
      <p class="sectionTitle">제11조 (개인정보 보유 및 이용기간)</p>
      <div class="paragraph">
        <p>1. 개인 정보는 회원이 해지 전까지 보유하며, 해지시까지 회원 정보를 회사에서 보유합니다. 단, 홈페이지에 로그인 한 후 1년간 사용하지 않으면 자동 삭제됩니다.</p>
        <p>2. 회원은 본인이 해지 전까지 이용할 수 있습니다.</p>
      </div>
      <p class="sectionTitle">제3장 서비스 이용</p>
      <p class="sectionTitle">제12조 (서비스의 이용시간)</p>
      <div class="paragraph">
        <p>1. 회사는 회원의 이용신청을 승낙한 때부터 즉시 서비스를 개시합니다. 단, 회사의 업무상 또는 기술상의 장애로 인하여
          서비스를 개시하지 못하는 경우, 서비스에 공지하거나 회원에게 즉시 이를 통지합니다.</p>
        <p>2. 서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만 회사가 업무상 또는 기술상의 이유로 서비스의 전부
          또는 일부가 일시 중지되거나, 운영상의 목적으로 회사가 정한 기간에는 서비스의 전부 또는 일부가 일시 중지될 수 있습니다. 이러한
          경우 회사는 사전 또는 사후 이를 공지합니다.</p>
        <p>3. 회사는 서비스 별로 이용 가능한 시간을 별도로 정할 수 있으며 이 경우 그 내용을 사전에 공지합니다.</p>
      </div>
      <p class="sectionTitle">제13조 (서비스 제공 및 변경)</p>
      <div class="paragraph">
        <p>1. 회사는 회사가 제공하는 서비스에서 진행하는 컨텐츠와 이벤트 등의 모든 서비스를 회원에게 제공합니다.</p>
        <p>2. 회사에서 제공하는 서비스는 무료서비스와 유료서비스가 있습니다. 서비스 추가 시 사전 공지하며 이용에 대한 사항은 회사가 별도로
          정한 서비스 약관 및 정책 또는 운영규칙에 따릅니다.</p>
        <p>3. 회사는 서비스 변경 시 그 변경될 서비스의 내용 및 제공일자를 사이트 초기화면에 게시하거나 전자메일 등을 통하여 회원에게 통지합니다.</p>
      </div>
      <p class="sectionTitle">제14조 (서비스의 요금)</p>
      <p>회사가 제공하는 배송대행 및 구매대행 서비스는 유료이며 각 서비스에서 표시된 요금을 지불하여야 이용할 수 있습니다.</p>
      <p class="sectionTitle">제15조 (정보의 제공 및 광고의 게재)</p>
      <div class="paragraph">
        <p>1. 회사는 서비스의 운용과 관련하여 서비스 화면, 홈페이지, 이메일 등의 회사에서 지정하는 위치에 광고 등을 게재할 수 있습니다. 이는
          광고주와의 계약관계에 의하거나 제공받은 컨텐츠의 출처를 밝히기 위한 조치입니다.</p>
        <p>2. 회원은 회사에서 제공하는 홈페이지 배너 광고에 대한 임의의 삭제, 비방 기타 홈페이지 배너 광고 방해 행위 등을 할 수 없습니다.</p>
        <p>3. 서비스 내에 포함되어 있는 링크를 클릭하여 타 사이트의 페이지로 옮겨갈 경우 해당 사이트의 개인정보보호정책은 회사와 무관합니다.</p>
      </div>
      <p class="sectionTitle">제16조 (게시물 또는 내용물의 삭제)</p>
      <p>회사는 서비스의 게시물 또는 내용물이 규정에 위반되거나 게시기간을 초과하는 경우 사전 통지나 동의 없이 이를 보완 또는 삭제할 수 있습니다.</p>
      <p class="sectionTitle">제17조 (서비스 제공의 중지)</p>
      <p>무료 서비스의 경우, 회사는 회사의 필요에 따라 언제든지 본 서비스의 전부 또는 일부를 수정하거나 중단할 수 있으며,이 경우 회사는
        전자우편 또는 인터넷 홈페이지 등을 통하여 회원에게 즉시 이를 고지합니다.</p>
      <p class="sectionTitle">제4장 권리와 의무</p>
      <p class="sectionTitle">제18조 (회사의 의무)</p>
      <div class="paragraph">
        <p>1. 회사는 특별한 사유가 없는 한 서비스 제공 설비를 항상 운용 가능한 상태로 유지 보수하여야 하며, 안정적으로 서비스를 제공할 수 있도록
          최선의 노력을 다하여야 합니다.</p>
        <p>2. 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 즉시 처리하여야 하며, 즉시 처리가 곤란한 경우 그 사유와 처리일정을
          서비스 또는 전자우편을 통하여 동 회원에게 통지하여야 합니다.</p>
      </div>
      <p class="sectionTitle">제19조 (회원의 의무)</p>
      <div class="paragraph">
        <p>1. 회원은 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항을 준수하여야 하며, 기타 회사의 업무에
          방해되는 행위를 하여서는 안 됩니다.</p>
        <p>2. 회원은 회사의 사전 동의 없이 서비스를 이용하여 어떠한 영리 행위도 할 수 없으며, 법에 저촉되는 자료를 배포 또는 게재할 수 없습니다.</p>
        <p>3. 회원은 자신의 아이디와 비밀번호를 유지 관리할 책임이 있으며 자신의 아이디와 비밀번호를 사용하여 발생하는 모든 결과에 대해 전적인 책임이 있습니다.
          또한 자신의 아이디와 비밀번호가 자신의 승낙 없이 사용되었을 경우 즉시 회사에 통보하여야 합니다.</p>
        <p>4. 회원은 서비스와 관련하여 다음 사항을 하여서는 아니 됩니다.</p>
        <p>(1) 서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복사, 복제, 변경, 번역, 출판, 방송 기타의 방법으로 사용하거나 이를 타인에게 제공하는 행위</p>
        <p>(2) 자신의 홈페이지와 게시판에 음란물을 게재 또는 음란사이트를 링크하거나, 유포 등 사회질서를 해치는 행위</p>
        <p>(3) 타인의 명예를 훼손하거나 모욕하는 행위, 타인의 지적재산권 등의 권리를 침해하는 행위</p>
        <p>(4) 해킹 또는 컴퓨터 바이러스를 유포하는 일, 타인의 의사에 반하여 광고성 정보 등 일정한 내용을 지속적으로 전송하는 행위</p>
        <p>(5) 다른 회원의 아이디를 부정 사용하는 행위</p>
        <p>(6) 다른 사용자의 개인 정보를 수집, 저장하는 행위</p>
        <p>(7) 회사 직원, 포럼 리더 등을 포함한 타인을 사칭하는 행위</p>
        <p>(8) 서비스를 통해 전송된 컨텐츠의 발신인을 위조하는 행위</p>
        <p>(9) 타인을 스톡(stalk)하거나, 괴롭히는 행위</p>
        <p>(10) 서비스의 운영에 지장을 주거나 줄 우려가 있는 일체의 행위, 기타 관계 법령에 위배되는 행위</p>
      </div>
      <p class="sectionTitle">제20조 (양도 금지)</p>
      <p>회원은 서비스의 이용권한, 기타 이용 계약상 지위를 타인에게 양도, 증여할 수 없으며,이를 담보로 제공할 수 없습니다.</p>
      <p class="sectionTitle">제21조 (게시물에 대한 권리 및 책임)</p>
      <div class="paragraph">
        <p>1. 회사는 회원의 게시물을 소중하게 생각하며 변조, 훼손, 삭제되지 않도록 최선을 다하여 보호합니다. 다만, 다음 각 호에 해당하는
          게시물이나 자료의 경우 사전통지 없이 삭제하거나 이동 또는 등록 거부를 할 수 있으며, 해당 회원의 자격을 제한, 정지 또는 상실 시 킬 수 있습니다.</p>
        <p>(1) 다른 회원 또는 제3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우</p>
        <p>(2) 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크 시키는 경우</p>
        <p>(3) 불법복제 또는 해킹을 조장하는 내용인 경우</p>
        <p>(4) 영리를 목적으로 하는 광고일 경우</p>
        <p>(5) 범죄적 행위에 결부된다고 인정되는 내용인 경우</p>
        <p>(6) 회사나 다른 회원의 저작권 혹은 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우</p>
        <p>(7) 회사에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우</p>
        <p>(8) 스팸성 게시물인 경우</p>
        <p>(9) 기타 관계법령에 위배된다고 판단되는 경우</p>
        <p>2. 회사가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 회사에 귀속됩니다.</p>
        <p>3. 회원이 서비스 화면 내에 게시한 게시물의 저작권은 게시한 회원에게 귀속됩니다. 또한 회사는 게시자의 동의 없이 게시물을 상업적으로
          이용할 수 없습니다. 다만, 비영리 목적인 경우는 그러하지 아니하며, 또한 본 사이트 내에서의 게재권을 갖습니다.</p>
      </div>
      <p class="sectionTitle">제22조 (계약해지 및 이용제한)</p>
      <div class="paragraph">
        <p>1. 회원이 약관의 내용을 위반할 경우 회사는 소정의 기간 이내에 이를 해소할 것을 통보하거나 즉시 해지할 수 있습니다.</p>
        <p>2. 회사는 제1항에 의해 해지된 회원이 다시 이용신청을 하는 경우 일정기간 그 승낙을 제한할 수 있습니다.</p>
        <p>3. 회원이 이용계약을 해지하고자 하는 때에는 회원 본인이 서비스 또는 전자우편을 통하여 해지신청을 하여야 합니다.</p>
      </div>
      <p class="sectionTitle">제23조 (손해배상)</p>
      <p>회사가 제공하는 서비스와 관련하여 회원에게 어떠한 손해가 발생하더라도 회사의 중대한 과실에 의한 경우를 제외하고 이에 대하여 책임을 부담하지 않습니다.</p>
      <p class="sectionTitle">제24조 (면책 조항)</p>
      <div class="paragraph">
        <p>1. 회사는 천재지변, 전쟁 및 기타 불가항력, 회사의 합리적인 통제 범위를 벗어난 사유로 인하여 서비스를 제공할 수 없는 경우에는 그에 대한 책임이 면제됩니다.</p>
        <p>2. 회사는 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우 책임이 면제됩니다.</p>
        <p>3. 회사는 회원이 서비스를 통해 게재 또는 전송한 정보, 자료, 사실의 정확성, 신뢰성 등 내용에 관하여 어떠한 보증도 하지 아니하며
          회원의 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해 등에 대해 책임을 지지 아니합니다.</p>
        <p>4. 회사는 회원이 서비스를 이용하여 기대하는 손익이나 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 아니합니다.</p>
        <p>5. 회사는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다.</p>
        <p>6. 회사는 회원의 귀책사유로 인하여 서비스 이용의 장애가 발생한 경우에는 책임이 면제됩니다.</p>
        <p>7. 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 이 약관을 위반한 회원은 회사에 발생되는 모든 손해를
          배상하여야 하며, 동 손해로부터 회사를 면책시켜야 합니다.</p>
        <p>8. 회사는 서비스에서 제공되는 전자우편의 메시지, 게시판의 게시물 등이 보유되는 최대일수, 송수신 할 수 있는 전자우편 메시지의 최대
          크기, 회원에게 할당되는 최대 디스크 공간 등 일반 사용에 대한 제한을 할 수 있습니다. 또한 일정 기간 동안 활동이 없는 계정을 해지할 수 있습니다.</p>
        <p>9. 어떠한 경우를 불문하고 회사는 배송지연으로 인한 손해에 대해서 책임지지 않습니다.</p>
        <p>10. "회사"는 배송 및 구매대행 신청서 작성시 주의사항 안내에 따르지 않은 회원에 손실에 대해서는 책임지지 않습니다.</p>
      </div>
    </div>
  </a-modal>
</template>

<script setup>
import {useStore} from 'vuex';

//通过 useStore从 Vuex 中获取 store 的实例。
const store = useStore();
const handleModalClose = () => {
  store.commit('setIsModalOpen', false);
};
const emit = defineEmits(['agree']);
const handleOk = () => {
  store.commit('setIsModalOpen', false);
  emit('agree');
};

</script>

<style>
.policyModal .ant-modal-content {
  padding: 0;
}

.policyModal .ant-modal-header .ant-modal-title {
  padding: 10px 16px;
  background: #ffd117;
}

.policyModal .ant-modal-close {
  top: 10px;
}

.policyModal .ant-modal-body {
  padding: 0 20px 0 25px;
}

.policyModal .ant-modal-footer {
  padding: 8px 20px 20px;
}

.sectionTitle {
  font-weight: bold;
}

.modal-content {
  max-height: 500px;
  padding-right: 12px;
  overflow-y: auto;
}

.paragraph p {
  position: relative;
  text-indent: -1em;
  margin-left: 1em;
}

.paragraph ul {
  padding-left: 20px;
}

.paragraph ul li {
  margin-bottom: 1em;
}
</style>